/*Напишіть функцію, яка має вхідні параметри A, B і N (цілі числа) і виконує наступне:

1) "розбирає" число B по цифрах (в циклі);

2) якщо поточна цифра дорівнює 0 - перехід на наступну ітерацію циклу (достроково);

3) підраховує остачу від ділення числа A на кожну поточну цифру числа B;

4) достроково припиняє цикл, коли кількість виконаних циклів перевищить задане число N;

5) знаходить і повертає суму результатів виконання п.3.*/


#include <stdio.h>

int main()
{
    int a,b,n;
    int dod1=0,dod2=0;

    /*
    printf ("Ведіть число A:");
    scanf ("%i", &a);
    */
 
    printf("Ведіть число B:");
    scanf("%i", &b);
  
    /*
    printf("Ведіть число N:");
    scanf("%i", &n);
    */
    
    do
    {
        dod1= b / 10;
        
        dod2= b / 10;

    }while (b<0);

    printf ("%i %i", dod1,dod2);
    
    
    return 0;
}