/*task 1. Напишіть функцію, яка приймає на вхід 3 цілі числа(змінні n1, n2, n3) і переставляє їх(переприсвоює змінні) 
в порядку зростання(з виводом на екран).Примітка : змінні у функцію передаються за посиланням ! */
#include <stdio.h>

void  mac(int *n1, int *n2, int *n3);

int main ()
{
    int n1,n2,n3;
   
    printf ("Ведіть число n1:");
    scanf ("%i", &n1);
    printf("Ведіть число n2:");
    scanf("%i", &n2);
    printf("Ведіть число n3:");
    scanf("%i", &n3);

    mac (&n1, &n2, &n3);

    printf ("Результат: %i\n %i \n %i\n", n1,n2,n3);
    return 0;

}

void mac(int *n1, int *n2, int *n3)
{   
    int a;

    if (*n2 > *n3)
    {
        a = *n3;
        *n3 = *n2;
        *n2 = a;
    }
    if (*n1 > *n3)
    {
        a = *n3;
        *n3 = *n1;
        *n1 = a;
    }
    if (*n1 > *n2)
    {
        a = *n2;
        *n2 = *n1;
        *n1 = a;
    }
}